# Библиотека Pandas

## Data Frame

In [1]:
import pandas as pd

In [4]:
#создание DataFrame по столбцам с помощью словарей
frame = pd.DataFrame({'numbers':range(10), 'chars':['a']*10})

In [2]:
['a']*10

['a', 'a', 'a', 'a', 'a', 'a', 'a', 'a', 'a', 'a']

In [3]:
range(10)

range(0, 10)

In [5]:
frame

   numbers chars
0        0     a
1        1     a
2        2     a
3        3     a
4        4     a
5        5     a
6        6     a
7        7     a
8        8     a
9        9     a

In [6]:
#создание DataFrame с помощью чтения данных из файла
frame = pd.read_csv('dataset.tsv', header=0, sep='\t')

In [7]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [8]:
frame.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

In [9]:
frame.shape

(6, 4)

In [10]:
new_line = {'Name':'Perov', 'Birth':'22.03.1990', 'City':'Penza'}

In [27]:
new_line = {'Name':'Perov', 'Birth':'22.03.1990', 'City':'Penza'}

In [14]:
true = 5
true

5

In [16]:
#добавление строки в DataFrame
frame.append(new_line, ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6            Perov  22.03.1990      Penza       NaN

In [18]:
#добавление строки в DataFrame
frame = frame.append(new_line, ignore_index=True)

In [19]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6            Perov  22.03.1990      Penza       NaN

In [20]:
[False]*5

[False, False, False, False, False]

In [21]:
[False]*5 + [True]*2

[False, False, False, False, False, True, True]

In [22]:
#добавление столбца в DataFrame
frame['IsStudent'] = [False]*5 + [True]*2

In [23]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN      False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      False
2       Белов М.М.  13.02.1980     Ростов  менеджер      False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      False
4      Рыбина Е.П.  19.11.1985     Москва   инженер      False
5     Костров С.О.  31.05.1985     Москва    стажер       True
6            Perov  22.03.1990      Penza       NaN       True

In [28]:
job = 'Employee'

In [29]:
frame['job'] = [False]*5 + [True]*2

In [ ]:
frame['job'] = [False, True, False, True]

In [ ]:
frame['job'] = [False]*2 + [True] + [False]*3

In [30]:
frame[job] = [False]*5 + [True]*2

In [34]:
frame['job kz'] = [False]*5 + [True]*2

In [35]:
frame

,Name,Birth,City,Position,IsStudent,job,Employee,job kz
0,Иванов А.А.,22.03.1980,Москва,NaN,False,False,False,False
1,Сорокин И.В.,07.08.1965,Волгоград,инженер,False,False,False,False
2,Белов М.М.,13.02.1980,Ростов,менеджер,False,False,False,False
3,Мельникова Д.С.,15.04.1985,Ростов,NaN,False,False,False,False
4,Рыбина Е.П.,19.11.1985,Москва,инженер,False,False,False,False
5,Костров С.О.,31.05.1985,Москва,стажер,True,True,True,True
6,Perov,22.03.1990,Penza,NaN,True,True,True,True

In [36]:
frame['job kz']

0    False
1    False
2    False
3    False
4    False
5     True
6     True
Name: job kz, dtype: bool

In [38]:
frame.'job kz'

SyntaxError: invalid syntax (<ipython-input-38-38ffc2a11130>, line 1)

In [39]:
frame

,Name,Birth,City,Position,IsStudent,job,Employee,job kz
0,Иванов А.А.,22.03.1980,Москва,NaN,False,False,False,False
1,Сорокин И.В.,07.08.1965,Волгоград,инженер,False,False,False,False
2,Белов М.М.,13.02.1980,Ростов,менеджер,False,False,False,False
3,Мельникова Д.С.,15.04.1985,Ростов,NaN,False,False,False,False
4,Рыбина Е.П.,19.11.1985,Москва,инженер,False,False,False,False
5,Костров С.О.,31.05.1985,Москва,стажер,True,True,True,True
6,Perov,22.03.1990,Penza,NaN,True,True,True,True

In [40]:
#удаление строк DataFrame
frame.drop([5,6], axis=0)

,Name,Birth,City,Position,IsStudent,job,Employee,job kz
0,Иванов А.А.,22.03.1980,Москва,NaN,False,False,False,False
1,Сорокин И.В.,07.08.1965,Волгоград,инженер,False,False,False,False
2,Белов М.М.,13.02.1980,Ростов,менеджер,False,False,False,False
3,Мельникова Д.С.,15.04.1985,Ростов,NaN,False,False,False,False
4,Рыбина Е.П.,19.11.1985,Москва,инженер,False,False,False,False

In [41]:
frame

,Name,Birth,City,Position,IsStudent,job,Employee,job kz
0,Иванов А.А.,22.03.1980,Москва,NaN,False,False,False,False
1,Сорокин И.В.,07.08.1965,Волгоград,инженер,False,False,False,False
2,Белов М.М.,13.02.1980,Ростов,менеджер,False,False,False,False
3,Мельникова Д.С.,15.04.1985,Ростов,NaN,False,False,False,False
4,Рыбина Е.П.,19.11.1985,Москва,инженер,False,False,False,False
5,Костров С.О.,31.05.1985,Москва,стажер,True,True,True,True
6,Perov,22.03.1990,Penza,NaN,True,True,True,True

In [42]:
#удаление строк DataFrame (inplace)
frame.drop([5,6], axis=0, inplace=True)

In [43]:
frame

,Name,Birth,City,Position,IsStudent,job,Employee,job kz
0,Иванов А.А.,22.03.1980,Москва,NaN,False,False,False,False
1,Сорокин И.В.,07.08.1965,Волгоград,инженер,False,False,False,False
2,Белов М.М.,13.02.1980,Ростов,менеджер,False,False,False,False
3,Мельникова Д.С.,15.04.1985,Ростов,NaN,False,False,False,False
4,Рыбина Е.П.,19.11.1985,Москва,инженер,False,False,False,False

In [44]:
#удаление столбца DataFrame (inplace)
frame.drop('IsStudent', axis=1, inplace=True)

In [45]:
frame

              Name       Birth       City  Position    job  Employee  job kz
0      Иванов А.А.  22.03.1980     Москва       NaN  False     False   False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер  False     False   False
2       Белов М.М.  13.02.1980     Ростов  менеджер  False     False   False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN  False     False   False
4      Рыбина Е.П.  19.11.1985     Москва   инженер  False     False   False

In [46]:
frame = frame.drop('job kz', axis=1)
frame

              Name       Birth       City  Position    job  Employee
0      Иванов А.А.  22.03.1980     Москва       NaN  False     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер  False     False
2       Белов М.М.  13.02.1980     Ростов  менеджер  False     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN  False     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер  False     False

In [49]:
frame

              Name       Birth       City  Position    job  Employee
0      Иванов А.А.  22.03.1980     Москва       NaN  False     False
1     Сорокин И.В.  07.08.1965  Волгоград   инженер  False     False
2       Белов М.М.  13.02.1980     Ростов  менеджер  False     False
3  Мельникова Д.С.  15.04.1985     Ростов       NaN  False     False
4      Рыбина Е.П.  19.11.1985     Москва   инженер  False     False

In [54]:
#запись DataFrame в файл
frame.to_csv('datasets/updated_dataset.csv', sep=',', header=True, index=False)

FileNotFoundError: [Errno 2] No such file or directory: 'datasets/updated_dataset.csv'

In [ ]:
pd.read_csv
pd.read_excel

pd.to_csv()
pd.to_excel()